VMKReddy/techmaker/g8-esp8266-bmp280/Src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"
#include "dma.h"
#include "i2c.h"
#include "usart.h"
#include "gpio.h"

/* USER CODE BEGIN Includes */
#include "lcd.h"
#include "ringbuffer_dma.h"
#include <string.h>
#include "BMP280.h"


/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* Ringbuffer for Rx messages */
RingBuffer_DMA rx_buf;
/* Array for DMA to save Rx bytes */
#define BUF_SIZE 4096
uint8_t rx[BUF_SIZE];
uint32_t rx_count = 0;
/* Array for received commands */
char cmd[BUF_SIZE];
uint8_t icmd = 0;

/* ESP8266 variables */
#define SERVER_ADDRESS		"techmaker.ua"
#define SERVER_TOKEN		"x1488uasbw"				// At least 10 symbols
#define WIFI_SSID			"EDUSPACE"
#define WIFI_PASS			"chasopys"
char wifi_cmd[512];

/* BMP280 variables */
double temp, press, alt;
int8_t com_rslt;
#define QNH 1023	// QNH (Sealevel) pressure for Zhulyany (UKKK)
					//http://www.aviador.es/Weather/Meteogram/UKKK#tabs-2

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

void UART_Read(void);

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_I2C1_Init();
  MX_UART4_Init();
  /* USER CODE BEGIN 2 */
  LCD_Init();

  	/* Init RingBuffer_DMA object */
  	RingBuffer_DMA_Init(&rx_buf, huart4.hdmarx, rx, BUF_SIZE);
  	/* Start UART4 DMA Reception */
  	HAL_UART_Receive_DMA(&huart4, rx, BUF_SIZE);

  	/* Start BMP280 and change settings */
  	LCD_Printf("Connecting to BMP280...\n");
  	bmp280_t bmp280 = {.i2c_handle = &hi2c1};
  	com_rslt = BMP280_init(&bmp280);
  	com_rslt += BMP280_set_power_mode(BMP280_NORMAL_MODE);
  	com_rslt += BMP280_set_work_mode(BMP280_STANDARD_RESOLUTION_MODE);
  	com_rslt += BMP280_set_standby_durn(BMP280_STANDBY_TIME_1_MS);
  	if (com_rslt != SUCCESS) {
  		LCD_Printf("Check BMP280 connection!\nProgram terminated");
  		return 0;
  	}
  	LCD_Printf("Connection successful!\n");

  	/* CONNECT TO WIFI ROUTER */
  	/* Simple ping */
  	sprintf(wifi_cmd, "AT+RST\r\n");
  	HAL_UART_Transmit(&huart4, (uint8_t *)wifi_cmd, strlen(wifi_cmd), 1000);
  	HAL_Delay(500);
  	UART_Read();
  	/* Turn on message echo */
  	sprintf(wifi_cmd, "ATE1\r\n");
  	HAL_UART_Transmit(&huart4, (uint8_t *)wifi_cmd, strlen(wifi_cmd), 1000);
  	HAL_Delay(100);
  	UART_Read();
  	/* Display version info */
  	sprintf(wifi_cmd, "AT+GMR\r\n");
  	HAL_UART_Transmit(&huart4, (uint8_t *)wifi_cmd, strlen(wifi_cmd), 1000);
  	HAL_Delay(500);
  	UART_Read();
  	/* Set to client mode */
  	sprintf(wifi_cmd, "AT+CWMODE=1\r\n");
  	HAL_UART_Transmit(&huart4, (uint8_t *)wifi_cmd, strlen(wifi_cmd), 1000);
  	HAL_Delay(100);
  	UART_Read();
  	HAL_Delay(2000);
  	/* Connect to network */
  	sprintf(wifi_cmd, "AT+CWJAP_CUR=\"%s\",\"%s\"\r\n", WIFI_SSID, WIFI_PASS);
  	HAL_UART_Transmit(&huart4, (uint8_t *)wifi_cmd, strlen(wifi_cmd), 1000);
  	HAL_Delay(10000);
  	UART_Read();
  	/* CONNECTED (hope so) */
  	/* Check for IP */
  	sprintf(wifi_cmd, "AT+CIFSR\r\n");
  	HAL_UART_Transmit(&huart4, (uint8_t *)wifi_cmd, strlen(wifi_cmd), 1000);
  	HAL_Delay(5000);
  	UART_Read();
  	/* Setup SSL */
  	sprintf(wifi_cmd, "AT+CIPSSLSIZE=4096\r\n");
  	HAL_UART_Transmit(&huart4, (uint8_t *)wifi_cmd, strlen(wifi_cmd), 1000);
  	HAL_Delay(500);
  	UART_Read();

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
	  /* Get BMP280 data */
	  		BMP280_read_temperature_double(&temp);
	  		BMP280_read_pressure_double(&press);
	  		alt = BMP280_calculate_altitude(QNH*100);
	  		/* Create request string */

	  		char http_req[256];
	  				sprintf(http_req,
	  					"GET /plotter/update.php?token=%s&temp=%.1f&press=%.0f&alt=%.1f HTTP/1.1\r\nHost: techmaker.ua\r\n\r\n",
	  					SERVER_TOKEN, temp, press, alt);
	  				/* Connect to server */
	  				sprintf(wifi_cmd, "AT+CIPSTART=\"TCP\",\"%s\",80\r\n", SERVER_ADDRESS);
	  		HAL_UART_Transmit(&huart4, (uint8_t *)wifi_cmd, strlen(wifi_cmd), 1000);
	  		HAL_Delay(10000);
	  		UART_Read();
	  		/* Send data length (length of request) */
	  		sprintf(wifi_cmd, "AT+CIPSEND=%d\r\n", strlen(http_req));
	  		HAL_UART_Transmit(&huart4, (uint8_t *)wifi_cmd, strlen(wifi_cmd), 1000);
	  		HAL_Delay(200); // wait for ">"
	  		UART_Read();
	  		/* Send data */
	  		HAL_UART_Transmit(&huart4, (uint8_t *)http_req, strlen(http_req), 1000);
	  		HAL_Delay(1800);
	  		UART_Read();
	  		/* Disconnect from server */
	  		sprintf(wifi_cmd, "AT+CIPCLOSE\r\n");
	  		HAL_UART_Transmit(&huart4, (uint8_t *)wifi_cmd, strlen(wifi_cmd), 1000);
	  		HAL_Delay(1000);
	  		UART_Read();

  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */

  }
  /* USER CODE END 3 */

}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Configure the main internal regulator output voltage 
    */
  __HAL_RCC_PWR_CLK_ENABLE();

  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 4;
  RCC_OscInitStruct.PLL.PLLN = 180;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 2;
  RCC_OscInitStruct.PLL.PLLR = 2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Activate the Over-Drive mode 
    */
  if (HAL_PWREx_EnableOverDrive() != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* USER CODE BEGIN 4 */
void UART_Read(void) {
	/* Check number of bytes in RingBuffer */
	rx_count = RingBuffer_DMA_Count(&rx_buf);
	/* Process each byte individually */
	while (rx_count--) {
		/* Read out one byte from RingBuffer */
		uint8_t b = RingBuffer_DMA_GetByte(&rx_buf);
		if (b == '\n') { /* If \n process command */
			/* Terminate string with \0 */
			cmd[icmd] = 0;
			icmd = 0;
			/* Display received messages */
			LCD_Printf("%s\n", cmd);
		} else if (b == '\r') { /* If \r skip */
			continue;
		} else { /* If regular character, put it into cmd[] */
			cmd[icmd++ % BUF_SIZE] = b;
		}
	}
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  file: The file name as string.
  * @param  line: The line in file as a number.
  * @retval None
  */
void _Error_Handler(char *file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
